{"id":77612,"name":"Accessible Online Learning Community Group","is_closed":false,"description":"<p>Accessibility is often provided through accommodations. Schools are legally obligated to provide accommodations to enrolled students with identified disabilities, based on their needs—sign language interpreters in lectures for deaf students, digital copies of textbooks for students who are blind or have reading difficulties, extended time on exams for students who need more time due to cognitive or physical disabilities.</p>\r\n\r\n<p>With online learning, the obligations are less clear—for example, with MOOCs, where students around the world are taking courses but are not enrolled at the sponsoring school or organization. Also, accommodations are not well established—sign language interpreters and note takers are typically accommodations for the physical classroom. How does an organization ensure they are meeting obligations and giving online students the support they need participate fully and to be successful?</p>\r\n\r\n<p>Providers of online learning are best off delivering courses that are accessible out-of-the-box, without the need for special accommodations. And many of the features that provide an accessible experience for people with disabilities benefit all learners. For example, lecture transcripts are an excellent tool for study and review. However, without deliberate attention to the technologies, standards, and guidelines that comprise the Web Platform, accessibility may be difficult to achieve, and learners with disabilities may be left behind.</p>\r\n\r\n<p>The activities of the Accessible Online Learning W3C Community Group take place at the intersection of accessibility and online learning. We focus on reviewing current W3C resources and technologies to ensure the requirements for accessible online learning experiences are considered. We also identify areas where additional resources and technologies are needed to ensure full participation of people with disabilities in online learning experiences.</p>\r\n\r\n<p>This group will not publish Specifications.</p>\r\n","shortname":"accesslearn","discr":"w3cgroup","type":"community group","_links":{"self":{"href":"https://api.w3.org/groups/cg/accesslearn"},"homepage":{"href":"https://www.w3.org/community/accesslearn/"},"users":{"href":"https://api.w3.org/groups/cg/accesslearn/users"},"services":{"href":"https://api.w3.org/groups/cg/accesslearn/services"},"chairs":{"href":"https://api.w3.org/groups/cg/accesslearn/chairs"},"join":{"href":"https://www.w3.org/community/accesslearn/join"},"participations":{"href":"https://api.w3.org/groups/cg/accesslearn/participations"}},"identifier":"cg/accesslearn"}