{"id":79043,"name":"Stroke Fonts Community Group","is_closed":false,"description":"<h3>An attempt to find ways of using stroke fonts in design workflows</h3>\r\n\r\nA stroked font is based on the idea of describing a collection of glyphs by their center line or the movement of a pen rather than their outlines. The center line, or skeleton, would then be styled either from inside the font, either from any software that acts downstream on the text, according to parameters that are yet to be defined. But might be based on the concept of an object following a path.\r\n\r\nThis could be a very different approach than those embedded in the font formats currently in wide use. There will be a lot of issues to address for this to move forward. Drawing letters from their skeleton allow users for other styling options, but also allows the computer for a larger understanding of a glyphs shape as a whole or it's important features, regions, parts. Based on this understanding it woud be easier to algorithmically alter these glyphs' shapes -- while composing texts for example.\r\n\r\nIt would enlarge the scope of what this group aims to do. Going towards a parametric approach of designing fonts, and considering the resulting transformation of the composition process. From fonts to lettering, from typography to writing.\r\n\r\nWe aim to discover, adapt or develop a way to make these fonts usable and stylable in a variety of scenarios, such as web pages, canvas based design tools, as well as pen plotters, CNC, PCP and cartography design environments.","shortname":"stroke-fonts","discr":"w3cgroup","type":"community group","_links":{"self":{"href":"https://api.w3.org/groups/cg/stroke-fonts"},"homepage":{"href":"https://www.w3.org/community/stroke-fonts/"},"users":{"href":"https://api.w3.org/groups/cg/stroke-fonts/users"},"services":{"href":"https://api.w3.org/groups/cg/stroke-fonts/services"},"chairs":{"href":"https://api.w3.org/groups/cg/stroke-fonts/chairs"},"join":{"href":"https://www.w3.org/community/stroke-fonts/join"},"participations":{"href":"https://api.w3.org/groups/cg/stroke-fonts/participations"}},"identifier":"cg/stroke-fonts"}