{
 "id": 72291,
 "name": "Linked Building Data Community Group",
 "is_closed": false,
 "description": "This group brings together experts in the area of building information modelling (BIM) and Web of Data technologies to define existing and future use cases and requirements for linked data based applications across the life cycle of buildings. A list of recommended use cases will be produced by this community group.  \r\n\r\nThe envisioned target beneficiaries of this group are both industrial and governmental organisations who use data from building information modelling applications and other data related to the building life cycle (sensor data, GIS data, material data, geographical data, and so forth) to achieve their business processes and whom will benefit from greater integration of data and interoperability between their data sets and the wider linked data communities. For example, benefit may be obtained by publishing and combining localised data on new cheaper building materials, energy efficient building devices and systems, along with real time data on weather patterns, energy prices and geodata. By making this data available to applications, they will be better able to support decision makers during the whole of the building life cycle, which includes design, construction, commissioning, operation, retrofitting/refurbishment/reconfiguration, demolition, and recycling of buildings. \r\n\r\nThe group will engage with these beneficiaries through surveys and events organised in conjunction with the affiliated workshop series on Linked Data for Architecture and Construction (LDAC).\r\n",
 "shortname": "lbd",
 "spec-publisher": true,
 "discr": "w3cgroup",
 "_links": {
  "self": {
   "href": "https://api.w3.org/groups/cg/lbd"
  },
  "homepage": {
   "href": "https://www.w3.org/community/lbd/"
  },
  "users": {
   "href": "https://api.w3.org/groups/cg/lbd/users"
  },
  "services": {
   "href": "https://api.w3.org/groups/cg/lbd/services"
  },
  "chairs": {
   "href": "https://api.w3.org/groups/cg/lbd/chairs"
  },
  "join": {
   "href": "https://www.w3.org/community/lbd/join"
  },
  "participations": {
   "href": "https://api.w3.org/groups/cg/lbd/participations"
  }
 },
 "type": "community group",
 "identifier": "cg/lbd"
}