{
 "id": 172308,
 "name": "Data Interoperating Architecture Community Group",
 "is_closed": false,
 "creation-date": "2025-11-05",
 "description": "<p>The Data Interoperating Architecture (DIA) Community Group aims to define an open and trustworthy framework for secure cross-domain data interoperability. It is dedicated to decoupling data from applications and supporting verifiable ownership and privacy-preserving data interconnectivity between heterogeneous systems.</p>\n\n<p>This initiative builds upon existing Web and Internet standards and extends them into a data-centric Internet architecture, enabling data to flow securely and autonomously between organizations and platforms. The Community Group will focus on developing interoperability specifications for data identification, authentication, data authorization, and security compliance, thereby building a protocol-level architecture to facilitate the development and construction of next-generation Internet infrastructure.</p>\n\n<p>The Community Group welcomes contributions from academia, industry, and standards bodies to jointly advance global interoperability practices. It will continuously evolve through iterative development and open collaboration, releasing reference specifications, best practices, and implementation guidelines to support the construction of a secure and trustworthy Internet.</p>",
 "shortname": "dia",
 "spec-publisher": true,
 "discr": "w3cgroup",
 "_links": {
  "self": {
   "href": "https://api.w3.org/groups/cg/dia"
  },
  "homepage": {
   "href": "https://www.w3.org/community/dia/"
  },
  "users": {
   "href": "https://api.w3.org/groups/cg/dia/users"
  },
  "services": {
   "href": "https://api.w3.org/groups/cg/dia/services"
  },
  "chairs": {
   "href": "https://api.w3.org/groups/cg/dia/chairs"
  },
  "join": {
   "href": "https://www.w3.org/community/dia/join"
  },
  "participations": {
   "href": "https://api.w3.org/groups/cg/dia/participations"
  }
 },
 "type": "community group",
 "tr-publisher": false,
 "group-type": "cg",
 "identifier": "cg/dia",
 "services": [
  {
   "href": "https://api.w3.org/services/45988",
   "title": "internal-dia (Mailing List)"
  },
  {
   "href": "https://api.w3.org/services/45986",
   "title": "IRC (Chat)"
  },
  {
   "href": "https://api.w3.org/services/45987",
   "title": "public-dia (Mailing List)"
  },
  {
   "href": "https://api.w3.org/services/45985",
   "title": "RSS (RSS)"
  }
 ]
}