{"id":139357,"name":"Audiovisual Media Formats for Browsers Community Group","is_closed":false,"description":"Over the past decade, a growing number of sound and imaging media formats have been established offering increasingly sophisticated user experiences such as High Dynamic Range (HDR) and Spatial Audio. On the imaging side, these media formats provide the technical means to facilitate increased spatial and temporal resolutions, higher bit depths, as well as varying color volumes and the mapping between them. Similarly, on the audio side, higher bit-depth, sample rates and more immersive surround sound and speech processing options are available.\r\nThese experiences are facilitated through tools and technical mechanisms available to both professional and consumer content providers and are readily available for linear content types. However, options to provide such experiences through the web are still limited as potential solutions are fragmented and often insular or significantly limited in capabilities among open source as well as proprietary options. This typically results in incorrect presentation to an end user or even error messages. \r\nTherefore, there is need to consider how to support modern audiovisual formats in a W3C context. To alleviate friction in development and deployment, it seems highly beneficial to our community to synchronize open and proprietary solutions so that they can co-exist within a W3C framework. The scope of this community group is to provide a forum for those discussions.\r\n","shortname":"av4browsers","discr":"w3cgroup","type":"community group","_links":{"self":{"href":"https://api.w3.org/groups/cg/av4browsers"},"homepage":{"href":"https://www.w3.org/community/av4browsers/"},"users":{"href":"https://api.w3.org/groups/cg/av4browsers/users"},"services":{"href":"https://api.w3.org/groups/cg/av4browsers/services"},"chairs":{"href":"https://api.w3.org/groups/cg/av4browsers/chairs"},"join":{"href":"https://www.w3.org/community/av4browsers/join"},"participations":{"href":"https://api.w3.org/groups/cg/av4browsers/participations"}},"identifier":"cg/av4browsers"}