{
 "id": 174170,
 "name": "Universal Health Data Schemas for Privacy-Preserving AI Community Group",
 "is_closed": false,
 "creation-date": "2026-01-21",
 "description": "<p>The mission of this group is to define a universal, modular, and interoperable set of data schemas for health information. Our goal is to enable the aggregation and utilization of data for medical research and AI training through privacy-enhancing technologies (PETs) like Zero-Knowledge Proofs (ZKPs), while ensuring patient control and consent via Verifiable Credentials (VCs).</p>\r\n\r\n<h4>Scope and Problem Statement</h4>\r\n\r\n<p>The development of robust medical AI is hampered by siloed, non-standardized, and sensitive health data. Current data formats are incompatible across institutions, and privacy regulations prevent the sharing of raw data, creating a significant barrier to collaborative research. This group will address this by creating schemas that transform health data into standardized, verifiable, and privacy-preserving assets.</p>\r\n\r\n<h4>Key Deliverables</h4>\r\n\r\n<ul>\r\n<li>A core set of modular, extensible Verifiable Credential schemas for common medical data types (e.g., lab results, imaging reports, prescriptions, diagnoses)</li>\r\n<li>Best practice guidelines for issuing these VCs from trusted sources (e.g., hospitals, clinics)</li>\r\n<li>Specifications for generating Zero-Knowledge Proofs from these VCs to enable privacy-preserving queries and analytics</li>\r\n<li>Use cases and implementation patterns for federated learning and AI model training using the proposed schemas and ZKP protocols</li>\r\n</ul>",
 "shortname": "uhds",
 "spec-publisher": true,
 "discr": "w3cgroup",
 "_links": {
  "self": {
   "href": "https://api.w3.org/groups/cg/uhds"
  },
  "homepage": {
   "href": "https://www.w3.org/community/uhds/"
  },
  "users": {
   "href": "https://api.w3.org/groups/cg/uhds/users"
  },
  "services": {
   "href": "https://api.w3.org/groups/cg/uhds/services"
  },
  "chairs": {
   "href": "https://api.w3.org/groups/cg/uhds/chairs"
  },
  "join": {
   "href": "https://www.w3.org/community/uhds/join"
  },
  "participations": {
   "href": "https://api.w3.org/groups/cg/uhds/participations"
  }
 },
 "type": "community group",
 "tr-publisher": false,
 "group-type": "cg",
 "identifier": "cg/uhds",
 "services": [
  {
   "href": "https://api.w3.org/services/46047",
   "title": "internal-uhds (Mailing List)"
  },
  {
   "href": "https://api.w3.org/services/46045",
   "title": "IRC (Chat)"
  },
  {
   "href": "https://api.w3.org/services/46046",
   "title": "public-uhds (Mailing List)"
  },
  {
   "href": "https://api.w3.org/services/46044",
   "title": "RSS (RSS)"
  }
 ]
}