{
 "id": 91376,
 "name": "Voice Interaction Community Group",
 "is_closed": false,
 "description": "Existing W3C voice interaction standards such as VoiceXML are based on use cases centered around telephony-based voice systems. The typical interaction style that these standards support is system-initiated directed dialog using grammars to constrain the speech recognizer. In recent years, interaction with voice applications has become much more flexible, with a user-initiated dialog style and significantly fewer constraints on spoken input. \r\n\r\nMany of these new applications take the form of \"virtual assistants\". These include general-purpose assistants (for example, Siri, Cortana, Google Now and Alexa) as well as virtual assistants with specialized domain expertise. The proposed Community Group will collect new use cases for voice interaction, develop requirements for applications such as virtual assistants and explore areas for possible standardization, possibly producing specifications if appropriate. Depending on interest, this exploration could include such topics as (1) discovery of virtual assistants with specific expertise, for example a way to find a virtual assistant that can supply weather information (2) standard formats for statistical language models for speech recognizers (3) standard representations for references to common concepts such as time (4) interoperability for conversational interfaces and (5) work on dialogue management or  ‘workflow' languages . New functionality for existing voice standards can also be a topic of discussion.\r\nSpeech application developers and voice user interface designers should be particularly interested in this group.",
 "shortname": "voiceinteraction",
 "discr": "w3cgroup",
 "_links": {
  "self": {
   "href": "https://api.w3.org/groups/cg/voiceinteraction"
  },
  "homepage": {
   "href": "https://www.w3.org/community/voiceinteraction/"
  },
  "users": {
   "href": "https://api.w3.org/groups/cg/voiceinteraction/users"
  },
  "services": {
   "href": "https://api.w3.org/groups/cg/voiceinteraction/services"
  },
  "chairs": {
   "href": "https://api.w3.org/groups/cg/voiceinteraction/chairs"
  },
  "join": {
   "href": "https://www.w3.org/community/voiceinteraction/join"
  },
  "participations": {
   "href": "https://api.w3.org/groups/cg/voiceinteraction/participations"
  }
 },
 "type": "community group",
 "identifier": "cg/voiceinteraction"
}