{"id":71940,"name":"Human Services Community Group","is_closed":false,"description":"<h3>Goals</h3>\r\n\r\n<p>The goals of the Community Group on Human Service Data are to:</p>\r\n<ol>\r\n<li> Create an ongoing conversation space around world data standards in the human service sector, involving stakeholders from multiple perspectives including:\r\n<ol type=\"a\">\r\n    <li>government human service agencies, for-profit companies, and NGOs; \r\n\r\n    </li><li>diverse substantive areas, such as welfare benefits eligibility, health interfaces, information and referral services, homelessness, substance abuse, child welfare, aging and disability resources, juvenile justice, etc.; \r\n\r\n    </li><li>diverse stakeholder purposes including exchange of data for operational purposes and collection of data for performance measurement, evaluation and policy research. \r\n</li></ol></li>\r\n<li> Facilitate the development, improvement and convergence of human service data standards, vocabularies, ontologies, and domain models by: <ol type=\"a\">\r\n\r\n<li>Cataloging human services ontologies worldwide, and creating a Linked Open Data directory of the ontologies.  The directory should contain metadata, such as audience, jurisdiction, potential ontology improvements, related ontologies, and other notes.  See Github site linked off the group page for group artifacts.\r\n     \r\n</li><li> Fostering wider recognition of existing efforts and artifacts\r\n\r\n</li><li> Analyzing the strengths, limitations, and areas of overlap, agreement and divergence of existing efforts and artifacts\r\n\r\n</li><li> Identifying areas where standards do not yet exist, but are needed\r\n\r\n</li><li> Convening working groups of diverse composition to develop and improve standards\r\n</li></ol></li>\r\n<li> Promote the adoption of human services standards</li>\r\n</ol>\r\n\r\n\r\n<h3>Scope of Work</h3>\r\n\r\n<p>The boundary of the Community Group’s work is the set of\r\nsubstantive areas which are recognized in the United States\r\nand/or internationally as falling within the human service\r\nsector. This includes but is not limited to information and\r\nreferral services, income support and other welfare benefits,\r\nemployment training, homelessness, substance abuse, mental\r\nhealth, child welfare, juvenile justice, domestic violence, and\r\nsenior services.\r\n\r\n</p><p>The borders between the human service sector on the one hand and\r\nthe health, education and justice sectors on the other hand are\r\nnot firmly defined. The community group will be open to working\r\non any area that is related to the human services and is not\r\nentirely within the boundaries of the health, education or\r\njustice sectors.\r\n\r\n</p><h3>Deliverables</h3>\r\n\r\n<p>To be determined.</p>\r\n","shortname":"humanservices","discr":"w3cgroup","type":"community group","_links":{"self":{"href":"https://api.w3.org/groups/cg/humanservices"},"homepage":{"href":"https://www.w3.org/community/humanservices/"},"users":{"href":"https://api.w3.org/groups/cg/humanservices/users"},"services":{"href":"https://api.w3.org/groups/cg/humanservices/services"},"chairs":{"href":"https://api.w3.org/groups/cg/humanservices/chairs"},"join":{"href":"https://www.w3.org/community/humanservices/join"},"participations":{"href":"https://api.w3.org/groups/cg/humanservices/participations"}},"identifier":"cg/humanservices"}