{"id":86794,"name":"Web We Can Afford Community Group","is_closed":false,"description":"Most scientists now seem to agree that we've entered a new epoch dubbed the \"Anthropocene\", where the environmental consequences of human development have a tremendous impact on Earth's equilibrium. Those effects are already set in motion and will have far-reaching consequences in the coming years despite all the measures we could take to mitigate them (considering we simply do not fail to take action). While trying to avoid some of the consequences of the Anthropocene is an issue that is well-worth striving for, another task would be to reconsider the design of things at the time of the Anthropocene and that includes the Web. For instance, a 2008 study by the University of Dresden stated that if no measure was taken, the energy needed to power the infrastructure of the Web in 2030 would be tantamount to the energy consumed by humanity in 2008.\r\nThe agendas of the stakeholders who are trying to set the Web forward in motion are mainly focused on adding new technological layers to the existing ones. Yet, the logic behind these developments remains that of tapping into unlimited resources, not limited ones. Lots of endeavors are currently focused on reshaping the Web into a \"Web we want\", a redecentralized open Web fit for an enlightened digital age. Those who advocate such an agenda and those who oppose it generally both share a common assumption: that enlightened or not, the future will be even more digital than the present. Yet, life at the time of the Anthropocene, at least in the coming decades, might not remain as pervasively digital as it is today. Other efforts that see the ongoing battle for the decentralization of the Web as an opportunity to “downscale” it (in particular in Africa) seem to be aware of that. Maybe it's time to take into account other perspectives on the future and concretely act towards building a sustain-able (Tony Fry) Web. In other words, a Web We Can Afford.\r\nThis group would like to reconcile the development of the Web and an awareness to the environmental issues by appealing to Web architects and designers, eco-designers, activists, philosophers, social scientists, etc., so as to make the issue a public one to begin with, before devising a set of guidelines as a first step towards concrete action.\r\n","shortname":"wwca","discr":"w3cgroup","type":"community group","_links":{"self":{"href":"https://api.w3.org/groups/cg/wwca"},"homepage":{"href":"https://www.w3.org/community/wwca/"},"users":{"href":"https://api.w3.org/groups/cg/wwca/users"},"services":{"href":"https://api.w3.org/groups/cg/wwca/services"},"chairs":{"href":"https://api.w3.org/groups/cg/wwca/chairs"},"join":{"href":"https://www.w3.org/community/wwca/join"},"participations":{"href":"https://api.w3.org/groups/cg/wwca/participations"}},"identifier":"cg/wwca"}