{
 "id": 138327,
 "name": "Semantic HTML-vocabulary Community Group",
 "is_closed": false,
 "description": "The mission of this community group is to establish a draft standard for a RDF-based representation of the HTML-vocabulary. With the HTML-vocabulary in RDF, any type of an HTML-document can be meaningfully represented, generated and validated using nothing but standard semantic technologies, without any vendor lock-in. In addition, full provenance can be provided for a generated HTML-document, as every atom of the document can be described and semantically enriched, ex ante (RDF) and ex post (Rdfa). For instance, the originating algorithm that calculates a certain budget amount in a governmental HTML-document can be linked to the table cell containing the very value. HTML-documents have a wide variety of use and so has the HTML vocabulary. The HTML-vocabulary can be used to generate 100% correct HTML or xHTML and to validate this. The HTML vocabulary can be used to model the front end of a website or application, whereas the logic behind the front end can be captured in SHACL Advanced Features, making for a full semantic representation and execution of digital infrastructure, without any vendor lock-in. An HTML-document can be generated with full compliance to laws and regulations, as these norms can be linked and applied while using the HTML-vocabulary. With full provenance, an HTML-document can battle fake news and show realtime how certain sensitive data in the document (privacy, security) was derived.\r\n\r\nThe community group will come up with a 0.1 draft specification. This will be input for a future working group within W3C. The community group can make use of the currently available draft specification as developed by the Dutch Ministry of Finance in a working prototype for the Dutch governmental budget cycle. By starting this community group, the Dutch Ministry wants to contribute to an open source based digital infrastructure.",
 "shortname": "htmlvoc",
 "spec-publisher": true,
 "discr": "w3cgroup",
 "_links": {
  "self": {
   "href": "https://api.w3.org/groups/cg/htmlvoc"
  },
  "homepage": {
   "href": "https://www.w3.org/community/htmlvoc/"
  },
  "users": {
   "href": "https://api.w3.org/groups/cg/htmlvoc/users"
  },
  "services": {
   "href": "https://api.w3.org/groups/cg/htmlvoc/services"
  },
  "chairs": {
   "href": "https://api.w3.org/groups/cg/htmlvoc/chairs"
  },
  "join": {
   "href": "https://www.w3.org/community/htmlvoc/join"
  },
  "participations": {
   "href": "https://api.w3.org/groups/cg/htmlvoc/participations"
  }
 },
 "type": "community group",
 "identifier": "cg/htmlvoc",
 "services": [
  {
   "href": "https://api.w3.org/services/34826",
   "title": "RSS"
  },
  {
   "href": "https://api.w3.org/services/34827",
   "title": "Chat"
  },
  {
   "href": "https://api.w3.org/services/34828",
   "title": "Mailing List"
  },
  {
   "href": "https://api.w3.org/services/34829",
   "title": "Mailing List"
  },
  {
   "href": "https://api.w3.org/services/34831",
   "title": "Version Control",
   "details": {
    "type": "repository",
    "link": "https://github.com/floresbakker/htmlvoc",
    "shortdesc": "GitHub",
    "longdesc": "GitHub",
    "external": true,
    "closed": false,
    "_links": {
     "self": {
      "href": "https://api.w3.org/services/34831"
     },
     "groups": {
      "href": "https://api.w3.org/services/34831/groups"
     }
    }
   }
  }
 ]
}