{
 "id": 69757,
 "name": "Declarative Linked Data Apps Community Group",
 "is_closed": false,
 "description": "The mission of this group is to produce a specification that describes how Web and Linked Data applications can be built using declarative technologies only, minimizing the need for source code.\r\n\r\nCurrent software development models involve writing source code (mostly in imperative languages) and building programs from it. Source code is prone to bugs, and managing it requires developers. The declarative approach is instead to push as much application logic from source code to data, so that the application can be managed and reused as data itself, while the software become generic and application-independent.\r\n\r\nThis approach is related to functional languages and to processing pipelines. The generic software works as a processor: it takes the incoming request and the declarative application description and runs it through a pipeline, first retrieving the state of the requested resource (or changing it) and then rendering it into the requested format, such as a Web page. This is similar to an XSLT processor transforming XML documents.\r\n\r\nGraphity is a production-level platform for declarative end-user Linked Data applications with an RDF triplestore backend. It processes ontologies describing application structure, which seemlesly combine multiple declarative technolgies: URI templates, SPIN SPARQL templates, XSLT stylesheets (both server- and client-side), and RDF/POST encoding.\r\n\r\nPlease join this group if you're interested in any practical or theoretical aspects of Linked Data, declarative technologies, or Graphity software.",
 "shortname": "declarative-apps",
 "discr": "w3cgroup",
 "type": "community group",
 "_links": {
  "self": {
   "href": "https://api.w3.org/groups/cg/declarative-apps"
  },
  "homepage": {
   "href": "https://www.w3.org/community/declarative-apps/"
  },
  "users": {
   "href": "https://api.w3.org/groups/cg/declarative-apps/users"
  },
  "services": {
   "href": "https://api.w3.org/groups/cg/declarative-apps/services"
  },
  "chairs": {
   "href": "https://api.w3.org/groups/cg/declarative-apps/chairs"
  },
  "join": {
   "href": "https://www.w3.org/community/declarative-apps/join"
  },
  "participations": {
   "href": "https://api.w3.org/groups/cg/declarative-apps/participations"
  }
 },
 "identifier": "cg/declarative-apps"
}