{
 "id": 65404,
 "name": "Electronic Governance (eGov) Community Group",
 "is_closed": false,
 "description": "The mission of the Electronic Governance Community Group (formerly W3C e-Government Interest Group) is to build and strengthen the community of people who actively develop, use or promote the use of W3C technologies to improve the working of government (Electronic Government) and its interactions with citizens, businesses, civil society and other arms of government (Electronic Governance). \r\n\r\nAs a part of its activities, the Group will identify and discuss essential areas of technology, organizational and social change, and related policy issues. Such areas include but are not limited to: access and accessibility; cloud computing; data licensing; education and outreach; government as a platform; interoperability; information sharing; innovation and innovation transfer; impact, public value and economic evaluation; knowledge management; mobile government; open government; privacy, security and sensitive data; standardization versus adaptation; transparency and accountability; whole-of-government; and others. The discussions will occur, among other places, on the Group's mailing list, in teleconference seminars, and at face-to-face gatherings. On the topics with sufficient interest and motivated participants, the group will form task forces to produce technical documents and policy recommendations, reach out to relevant communities, and even encourage the formation of specialized EGOV-related community groups.",
 "shortname": "egovernance",
 "discr": "w3cgroup",
 "type": "community group",
 "_links": {
  "self": {
   "href": "https://api.w3.org/groups/cg/egovernance"
  },
  "homepage": {
   "href": "https://www.w3.org/community/egovernance/"
  },
  "users": {
   "href": "https://api.w3.org/groups/cg/egovernance/users"
  },
  "services": {
   "href": "https://api.w3.org/groups/cg/egovernance/services"
  },
  "chairs": {
   "href": "https://api.w3.org/groups/cg/egovernance/chairs"
  },
  "join": {
   "href": "https://www.w3.org/community/egovernance/join"
  },
  "participations": {
   "href": "https://api.w3.org/groups/cg/egovernance/participations"
  }
 },
 "identifier": "cg/egovernance"
}