{
 "id": 62545,
 "name": "Research Object for Scholarly Communication Community Group",
 "is_closed": false,
 "description": "Research investigations are increasingly collaborative and require ‘‘borrowing strength’’ from the outputs of other research. Conventional digital publications are becoming less sufficient for the scientists to access, share, communicate, and enable the reuse of scientific outputs. The need to have a community-wide container data model to encapsulate the actual research data and methods with all the contextual information essential for interpreting and reusing them is becoming more and more imperative, for the science, publisher, as well as digital library communities.\r\n\r\nA number of different community groups and projects are now creating some form of container, bundling or aggregation mechanism (particularly using ORE OAI), partially driven by the above goal. There is a clear need and benefit to facilitate a consensus among these representations. In the ROSC community group we aim to provide an open platform for gathering and discussing current development of various container models and their implementations. These data models should be driven by the need of facilitating the reuse and exchange of the actual digital knowledge and the inspection of the reproducibility of scientific investigation results. They should consider not only the data used, methods employed to produce and analyse that data, but also the people involved in the investigation and annotations about these resources, which are essential to the understanding and interpretation of the scientific outcomes.\r\n\r\nAs outcomes from the community group we aim to facilitate the establishment of  a community data model and a set of community agreements that can effectively assist the establishment of a new form of scholarly communication, that is a prominent issue of today.\r\n\r\nThis group will not publish specifications.",
 "shortname": "rosc",
 "discr": "w3cgroup",
 "type": "community group",
 "_links": {
  "self": {
   "href": "https://api.w3.org/groups/cg/rosc"
  },
  "homepage": {
   "href": "https://www.w3.org/community/rosc/"
  },
  "users": {
   "href": "https://api.w3.org/groups/cg/rosc/users"
  },
  "services": {
   "href": "https://api.w3.org/groups/cg/rosc/services"
  },
  "chairs": {
   "href": "https://api.w3.org/groups/cg/rosc/chairs"
  },
  "join": {
   "href": "https://www.w3.org/community/rosc/join"
  },
  "participations": {
   "href": "https://api.w3.org/groups/cg/rosc/participations"
  }
 },
 "identifier": "cg/rosc"
}