{
 "id": 171210,
 "name": "Meta-Layer Infrastructure Community Group",
 "is_closed": false,
 "creation-date": "2025-09-27",
 "description": "<h3>Mission</h3>\r\n<p>\r\nThe Meta-Layer Infrastructure Community Group will explore and advance protocols, design patterns, and shared standards for the interface layer of the Web—where people interact through browsers and overlays. Our goal is to support the emergence of a trusted, decentralized, civic infrastructure above Today’s Web, enabling contextual trust, coordination, and visible presence across communities and applications.</p>\r\n\r\n<p>This group may publish Specifications.</p>\r\n\r\n<h3>Scope</h3>\r\n\r\n<p>\r\nThis group will investigate and propose solutions in the following areas:\r\n</p>\r\n\r\n<ol>\r\n<li>Overlay coexistence and spatial protocol zones: Guidance for how browser extensions, tooltips, and overlays can avoid collisions (e.g., multiple extensions competing for the lower right corner), and how to foster cooperative behaviors across interface-layer tools.\r\n</li><li>Contextual annotation and semantic overlays: Building on existing Web Annotation standards, we will explore how communities can layer interpretable, contextual meaning on top of existing content—including the use of shared ontologies, tagged trust signals, and localized interpretation layers.\r\n</li><li>Presence and trust signaling at the interface layer: How to represent people, groups, and values in a transparent and auditable way, including live annotations, endorsements, and role-aware overlays—without requiring centralized backends.\r\n</li><li>Interface-level AI alignment: Proposals for grounding, auditing, and co-governing AI tools that operate at the interface (e.g., summarizers, guides, fact-checkers), including how overlays can provide context, source-trails, and counterfactuals.\r\n</li><li>Digital artifact recognition and integrity: Defining how communities and systems might represent and verify digital artifacts (e.g., credentials, publications, declarations) at the interface layer using open standards—without presupposing any specific backend architecture.\r\n</li></ol>\r\n\r\n<h3>Deliverables</h3>\r\n<ol>\r\n<li>A specification or design guide for overlay interoperability and spatial etiquette\r\n</li><li>Proposed extensions or usage conventions for Web Annotations and trust-layer metadata\r\n</li><li>Pattern libraries for presence-based interaction and integrity signaling\r\n</li><li>Draft interface standards for AI overlays and civic contextualization\r\n</li><li>Community dialogue around digital artifact integrity and use-case alignment\r\n</li></ol>\r\n\r\n<h3>Participation</h3><p>\r\nOpen in particular to standards developers, civic technologists, browser extension authors, Web annotation experts, trust &amp; safety practitioners, and communities interested in building shared public infrastructure across the Web.</p>",
 "shortname": "meta-layer",
 "spec-publisher": true,
 "discr": "w3cgroup",
 "_links": {
  "self": {
   "href": "https://api.w3.org/groups/cg/meta-layer"
  },
  "homepage": {
   "href": "https://www.w3.org/community/meta-layer/"
  },
  "users": {
   "href": "https://api.w3.org/groups/cg/meta-layer/users"
  },
  "services": {
   "href": "https://api.w3.org/groups/cg/meta-layer/services"
  },
  "chairs": {
   "href": "https://api.w3.org/groups/cg/meta-layer/chairs"
  },
  "join": {
   "href": "https://www.w3.org/community/meta-layer/join"
  },
  "participations": {
   "href": "https://api.w3.org/groups/cg/meta-layer/participations"
  }
 },
 "type": "community group",
 "tr-publisher": false,
 "group-type": "cg",
 "identifier": "cg/meta-layer",
 "services": [
  {
   "href": "https://api.w3.org/services/45959",
   "title": "internal-meta-layer (Mailing List)"
  },
  {
   "href": "https://api.w3.org/services/45957",
   "title": "IRC (Chat)"
  },
  {
   "href": "https://api.w3.org/services/45958",
   "title": "public-meta-layer (Mailing List)"
  },
  {
   "href": "https://api.w3.org/services/45956",
   "title": "RSS (RSS)"
  }
 ]
}