{
 "id": 78701,
 "name": "Healthcare Schema Vocabulary Community Group",
 "is_closed": false,
 "description": "<p>This community effort aims to provide medical,healthcare and life-science specialized web schemas and vocabulary through improving and extending the existing schemas, concepts, terms and definitions in schema.org vocabulary. Ultimate goal is to enable the use of schema.org not only by webmasters but also in indexing health records, healthcare documents, and as a pillar open source of medical and healthcare and life science ontology/vocabulary for formalization of healthcare information.</p>\r\n<p>This will make healthcare and medical data on web easy to describe correctly (with their correct meaning and context), easy to expose /index so ready to be accessible and will highly improve to re-usability and exchanging in semantic way, with their correct meaning and context.</p>\r\n<p>The intention is not to replace existing ontologies, nor making upper level ontology nor creating yet another clinical information model/standards. The aim is mainly to provide most useful and frequently used (so, demand driven) classes and properties related to the medical and healthcare domain. Within this scope all concepts are mapped as far as it's feasible to the existing terminology like SNOMED CT, ICD, LOINC, ATC, RxNorm, HL7 FHIR, etc.</p>\r\n",
 "shortname": "schemed",
 "discr": "w3cgroup",
 "_links": {
  "self": {
   "href": "https://api.w3.org/groups/cg/schemed"
  },
  "homepage": {
   "href": "https://www.w3.org/community/schemed/"
  },
  "users": {
   "href": "https://api.w3.org/groups/cg/schemed/users"
  },
  "services": {
   "href": "https://api.w3.org/groups/cg/schemed/services"
  },
  "chairs": {
   "href": "https://api.w3.org/groups/cg/schemed/chairs"
  },
  "join": {
   "href": "https://www.w3.org/community/schemed/join"
  },
  "participations": {
   "href": "https://api.w3.org/groups/cg/schemed/participations"
  }
 },
 "type": "community group",
 "identifier": "cg/schemed"
}