{
 "id": 127555,
 "name": "Consent Community Group",
 "is_closed": false,
 "description": "The concept of consent plays an essential role in the use of digital technologies as an enabler of the individual’s ownership, control, and agency. Regulations such as the GDPR assert this relationship by permitting use of consent as one of the possible legal bases for the lawful practice of data processing. Through this, obtaining consent is widely practised in the digital world, and can be perceived as an essential means to enable the individual’s agency regarding the management and ownership of their personal data. While different legal frameworks specify various requirements and obligations regarding the legal validity of consent, which should be, e.g. valid, freely given, specific, informed and active; existing and ongoing research shows that the majority of people are not empowered to practice their digital right to privacy and lawful \"consenting\" due to various malpractices and a lack of technological means acting in the individuals' interest.\r\n \r\nThis group aims to contribute towards the empowerment of humans concerning their rights of privacy and agency, by advocating interdisciplinary, pluralist, human-centric approaches to digital consent that are technologically and legally enforceable.\r\n \r\nThe mission of this group is to improve the experience of digital \"consenting\" while ensuring it remains adherent to relevant standards and laws. For this, the group will: (i) provide a space for people and stakeholders to come together (ii) highlight and analyse concepts, issues and problems about digital consenting (iii) propose and develop solutions. Some concrete areas for the working of this group are: (a) developing interdisciplinary solutions; (b) documenting and achieving legal compliance; (c) improving the user experience; and (d) utilising existing and developing new concepts and standards for digital consent. ",
 "shortname": "consent",
 "discr": "w3cgroup",
 "type": "community group",
 "_links": {
  "self": {
   "href": "https://api.w3.org/groups/cg/consent"
  },
  "homepage": {
   "href": "https://www.w3.org/community/consent/"
  },
  "users": {
   "href": "https://api.w3.org/groups/cg/consent/users"
  },
  "services": {
   "href": "https://api.w3.org/groups/cg/consent/services"
  },
  "chairs": {
   "href": "https://api.w3.org/groups/cg/consent/chairs"
  },
  "join": {
   "href": "https://www.w3.org/community/consent/join"
  },
  "participations": {
   "href": "https://api.w3.org/groups/cg/consent/participations"
  }
 },
 "identifier": "cg/consent"
}