{"id":107442,"name":"Data Privacy Vocabularies and Controls Community Group","is_closed":false,"description":"<p>The mission of the W3C Data Privacy Vocabularies and Controls CG (DPVCG) is to develop a taxonomy of privacy and data protection related terms, which include in particular terms from the new European <a href=\"http://eur-lex.europa.eu/eli/reg/2016/679/oj\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">General Data Protection Regulation (GDPR)</a>, such as a taxonomy of personal data as well as a classification of purposes (i.e., purposes for data collection), and events of disclosures, consent, and processing such personal data.</p>\r\n\r\n<p>The DPVCG was created as an outcome of the W3C Workshop on Data Privacy Controls and Vocabularies in Vienna in 2017, and started on 25th May 2018 &#8211; the date of the enforcement of GDPR. Since then, the DPVCG has worked to fulfil its aims and objectives, and produced the <a rel=\"noreferrer noopener nofollow\" href=\"https://www.w3.org/ns/dpv\" target=\"_blank\">Data Privacy Vocabulary (DPV)</a> as a deliverable. </p>\r\n\r\n<p>Membership to the group is open to all interested individuals and organisations. To join the group, you need a valid W3C account &#8211; which is free to get and can be <a rel=\"noreferrer noopener nofollow\" href=\"https://www.w3.org/accounts/request\" target=\"_blank\">requested here</a>. The group meets usually through online meeting calls, details of which, including past minutes, can be <a rel=\"noreferrer noopener nofollow\" href=\"https://www.w3.org/community/dpvcg/wiki/Meeting_Calls\" target=\"_blank\">found here</a>. The group also interacts through a <a rel=\"noreferrer noopener nofollow\" href=\"https://lists.w3.org/Archives/Public/public-dpvcg/\" target=\"_blank\">mailing list</a> regarding topics, discussions, sharing of agendas, actions, and other relevant items. The resources and work relevant to the group is hosted on the <a rel=\"noreferrer noopener nofollow\" href=\"https://github.com/dpvcg/\" target=\"_blank\">GitHub platform under the DPVCG name</a>.</p>\r\n\r\n<p>The group is currently chaired by:</p>\r\n\r\n<ul><li><a rel=\"noreferrer noopener nofollow\" href=\"https://harshp.com\" target=\"_blank\">Harshvardhan J. Pandit</a> (<a rel=\"noreferrer noopener nofollow\" href=\"https://www.adaptcentre.ie/\" target=\"_blank\">ADAPT SFI Research Centre</a>, <a rel=\"noreferrer noopener nofollow\" href=\"https://www.tcd.ie/\" target=\"_blank\">Trinity College Dublin</a>)</li><li><a rel=\"nofollow\" href=\"https://www.w3.org/People/Bos/\">Bert Bos</a> (<a href=\"https://www.ercim.eu/\" target=\"_blank\" rel=\"nofollow\">ERCIM </a><a rel=\"nofollow\" href=\"https://www.w3.org\">W3C</a>)</li><li><a href=\"http://polleres.net/\" target=\"_blank\" rel=\"nofollow\">Axel Polleres</a> <a href=\"https://www.wu.ac.at/\" target=\"_blank\" rel=\"nofollow\">(WU Wirschaftsuniversitat Wien &#8211; Vienna University of Economics and Business</a>)</li></ul>\r\n\r\n<h2>Participation in Group Activities</h2>\r\n\r\n<p>The working of the group is fairly open and transparent in its process, with most of the information present on the <a rel=\"nofollow\" href=\"https://www.w3.org/community/dpvcg/wiki/\">wiki</a>. For past work, actions, issues, and records &#8211; please refer to the <a rel=\"nofollow\" href=\"https://www.w3.org/community/dpvcg/wiki/\">wiki</a> and threads on the <a href=\"https://lists.w3.org/Archives/Public/public-dpvcg/\" target=\"_blank\" rel=\"nofollow\">mailing list</a>. Anyone can use the <a href=\"https://lists.w3.org/Archives/Public/public-dpvcg/\" target=\"_blank\" rel=\"nofollow\">mailing list</a> to ask questions, suggest topics, raise issues, and offer solutions. Non-members might receive an automated reply asking them to authenticate their email or email address for posting.</p>\r\n\r\n<p>Similarly, calls are usually open to attend, with the agenda shared on the public mailing list. Call details may be shared on the internal mailing lists accessible to only members for security purposes &#8211; so it may be best to ask the chair(s) or a member for attending a call.</p>\r\n\r\n<p>General questions regarding what the group considers in scope can be determined from the aims and objectives. Specific queries or propositions should be conveyed to the mailing list. For issues regarding the DPV, including addition of concepts or a query or other relevant topics &#8211; you can use the mailing list or the issues feature in a <a href=\"https://github.com/dpvcg/\" target=\"_blank\" rel=\"nofollow\">GitHub repo</a>.</p>\r\n\r\n<h2>Data Privacy Vocabulary (DPV)</h2>\r\n\r\n<p>The DPV is a vocabulary (terms) and an ontology (relationships) serialised using semantic-web standards to represent concepts associated with privacy and data protection, primarily derived from GDPR. It enables representation of which <em>personal data categories</em> are undergoing a what kind of <em>processing</em> by a specific <em>data controller</em> and/or transferred to some <em>recipient</em> for a particular <em>purpose</em>, based on a specific <em>legal basis</em> (e.g., consent, or other legal grounds such as legitimate interest, etc.), with specified <em>technical and organisational measures and restrictions</em> (e.g., storage locations and storage durations) in place.</p>\r\n\r\n<p>The DPV is useful as a machine-readable representation of personal data processing and can be adopted in relevant use-cases such as legal compliance documentation and evaluation, policy specification, consent representation and requests, taxonomy of legal terms, and annotation of text and data.</p>\r\n\r\n<p>The DPV is an evolving vocabulary &#8211; as the DPVCG continues to work on updating it with broader concepts as well as enriching its hierarchy of concepts. For this, we invite contributions of concepts, use-cases, requirements, and applications.</p>\r\n\t\r\n","shortname":"dpvcg","discr":"w3cgroup","type":"community group","_links":{"self":{"href":"https://api.w3.org/groups/cg/dpvcg"},"homepage":{"href":"https://www.w3.org/community/dpvcg/"},"users":{"href":"https://api.w3.org/groups/cg/dpvcg/users"},"services":{"href":"https://api.w3.org/groups/cg/dpvcg/services"},"chairs":{"href":"https://api.w3.org/groups/cg/dpvcg/chairs"},"join":{"href":"https://www.w3.org/community/dpvcg/join"},"participations":{"href":"https://api.w3.org/groups/cg/dpvcg/participations"}},"identifier":"cg/dpvcg"}