{"id":61141,"name":"Permanent Identifier Community Group","is_closed":false,"description":"The Permanent Identifier Community Group maintains a secure, permanent UL re-direction service for the Web located at w3id.org. Web applications that deal with Linked Data often need to specify and use URLs that are very stable. They utilize services such as the one run by this community to ensure that applications using their URLs will always be re-directed to a working website. The concept operates much like a switchboard, connecting requests for information with the true location of the information on the Web. Entries in the switchboard can be reconfigured to point to a new location if the old location stops working.\r\n\r\nThe community is responsible for all administrative tasks associated with operating the service. The social contract between organizations involved in the community gives each of them full access to all information required to maintain and operate the website. The agreement is setup such that a number of these organizations could fail, lose interest, or become unresponsive for long periods of time without negatively affecting the operation of the site. \r\n\r\n The service operates in HTTPS-only mode to ensure end-to-end security.  This means that it may be used for Linked Data applications that require high levels of security such as those found in the financial, medical, and public infrastructure sectors. \r\n\r\nAll identifiers associated with the service are intended to be around for as long as the Web is around. This means decades, if not centuries. If the final destination for popular identifiers used by this service fail in such a way as to be a major inconvenience or danger to the Web, the community will mirror the information for the popular identifier and setup a working redirect to restore service to the rest of the Web. \r\n\r\nYou may join this community by getting a W3C account and clicking the join button. If you wish to engage the community in discussion about this service for your Web application, please send an e-mail to the public-perma-id@w3.org mailing list. \r\n\r\nThis group does not create specifications.","shortname":"perma-id","discr":"w3cgroup","type":"community group","_links":{"self":{"href":"https://api.w3.org/groups/cg/perma-id"},"homepage":{"href":"https://www.w3.org/community/perma-id/"},"users":{"href":"https://api.w3.org/groups/cg/perma-id/users"},"services":{"href":"https://api.w3.org/groups/cg/perma-id/services"},"chairs":{"href":"https://api.w3.org/groups/cg/perma-id/chairs"},"join":{"href":"https://www.w3.org/community/perma-id/join"},"participations":{"href":"https://api.w3.org/groups/cg/perma-id/participations"}},"identifier":"cg/perma-id"}