{
 "id": 125883,
 "name": "Federated Commerce Community Group",
 "is_closed": false,
 "description": "<p>Decentralized e-commerce and storefront apps will more easily share and syndicate their products rather than relying on single and proprietary APIs from hosts to operate a storefront. By structuring portable commerce data stores, protocols, and semantics, this group seeks to enable marketplaces to be built more eaily and made more easily discoverable.</p>\r\n\r\n<p>This group's efforts will complement existing activities such as Web Payments, Linked Data, and DID, to deliver a search, browse, configure, checkout, and payment workflow for physical and digital products with mostly existing web technologies.</p>\r\n\r\n<p>At a higher-level, it would be potentially beneficial to include support for an aggregate query language, (such as SPARQL) to enable applications to query a known network of compatible applications for product information to better support web resource-to-web resource indexing and listing of products, increasing visibility without the need for central search engines. This would potentially utilize HTTP methods to register product catalogs in other web apps or request product catalogs from other web apps, enabling products to be purchased outside of the scope of the original commerce site, creating an aggregate marketing power across the web rather than depending on singular, monolithic e-commerce platforms.</p>",
 "shortname": "federated-commerce",
 "discr": "w3cgroup",
 "type": "community group",
 "_links": {
  "self": {
   "href": "https://api.w3.org/groups/cg/federated-commerce"
  },
  "homepage": {
   "href": "https://www.w3.org/community/federated-commerce/"
  },
  "users": {
   "href": "https://api.w3.org/groups/cg/federated-commerce/users"
  },
  "services": {
   "href": "https://api.w3.org/groups/cg/federated-commerce/services"
  },
  "chairs": {
   "href": "https://api.w3.org/groups/cg/federated-commerce/chairs"
  },
  "join": {
   "href": "https://www.w3.org/community/federated-commerce/join"
  },
  "participations": {
   "href": "https://api.w3.org/groups/cg/federated-commerce/participations"
  }
 },
 "identifier": "cg/federated-commerce"
}