{
 "id": 50069,
 "name": "Networked Data Community Group",
 "is_closed": false,
 "description": "The recent years have shown the need to deal with networked data in large-scale, distributed settings. Not only must the systems be scalable, elastic and performant, but also address *ability (usability, manageability, etc.). One key component is doing it the webby way. The Web is the leading concrete exemplar of RESTful design, being the result of posthumous analysis of what was already working with URIs, HTTP and HTML for a system of interlinked documents. Unfortunately the machine equivalent of HTML is still emerging. LinkedData has achieved some powerful results; automated navigation by querying the Linked Open Data cloud shows some of the potential. However many systems also need to evolve and be evolved. This can be expressed as 'service capability' and also needs to be supported with consistency. This should aim to eliminate the wide range of non-interoperable approaches muddling the current landscape of REST APIs through exploiting hypermedia concepts.\r\n\r\nThe Networked Data Community Group aims to provide a forum for collecting use cases including but not limited to the fields of science data (such as biology, astronomy, etc.), economics data (financial markets, etc.), health care, configuration and systems management, Green IT, and smart infrastructures (cities, etc.). Based on the collection of use cases the CG will derive requirements and write up best practices for dealing with the dynamics of the data.",
 "shortname": "networked-data",
 "discr": "w3cgroup",
 "type": "community group",
 "_links": {
  "self": {
   "href": "https://api.w3.org/groups/cg/networked-data"
  },
  "homepage": {
   "href": "https://www.w3.org/community/networked-data/"
  },
  "users": {
   "href": "https://api.w3.org/groups/cg/networked-data/users"
  },
  "services": {
   "href": "https://api.w3.org/groups/cg/networked-data/services"
  },
  "chairs": {
   "href": "https://api.w3.org/groups/cg/networked-data/chairs"
  },
  "join": {
   "href": "https://www.w3.org/community/networked-data/join"
  },
  "participations": {
   "href": "https://api.w3.org/groups/cg/networked-data/participations"
  }
 },
 "identifier": "cg/networked-data"
}