{"id":112823,"name":"Talent Marketplace Signaling Community Group","is_closed":false,"description":"<p>Much is said about the mismatch between the needs of employers for qualified employee candidates and a pool of available candidates.  One major factor contributing to this mismatch is the signaling between the demand-side (i.e., employers) and supply-side (i.e., education, training and credentialing providers, students and workers) of the talent pipeline. This mismatch frequently results in neither party coming into view of the other. The goal of the Talent Marketplace Signaling (TalentSignal) Community Group is to assist Schema.org in improving workforce signaling by refining existing schema.org types serving the talent pipeline and suggesting new types and properties where improved signaling cannot otherwise be achieved. Currently, workforce signaling sits at the intersection of a number of existing schema.org types: Course, JobPosting, Occupation, Organization, Person and the proposed EducationalOccupationalCredential.</p>\r\n <p>The TalentSignal Community Group will focus initially on refinement of the <a rel=\"nofollow\" href=\"https://schema.org/JobPosting\">JobPosting Schema</a> and related types as it survey's specifications from domain entities such as <a rel=\"nofollow\" href=\"https://hropenstandards.org/\">HR Open Standards</a> and <a rel=\"nofollow\" href=\"http://www.pesc.org/home.html\">PESC</a> as well as the US Chamber of Commerce Foundation's <a rel=\"nofollow\" href=\"https://www.uschamberfoundation.org/workforce-development/JDX\">Job Data Exchange (JDX)</a> and <a rel=\"nofollow\" href=\"https://www.uschamberfoundation.org/t3-innovation\">T3 Innovation Network</a> initiatives for better means to strong, more effective supply- and demand-side signaling.</p>","shortname":"talent-signal","discr":"w3cgroup","type":"community group","_links":{"self":{"href":"https://api.w3.org/groups/cg/talent-signal"},"homepage":{"href":"https://www.w3.org/community/talent-signal/"},"users":{"href":"https://api.w3.org/groups/cg/talent-signal/users"},"services":{"href":"https://api.w3.org/groups/cg/talent-signal/services"},"chairs":{"href":"https://api.w3.org/groups/cg/talent-signal/chairs"},"join":{"href":"https://www.w3.org/community/talent-signal/join"},"participations":{"href":"https://api.w3.org/groups/cg/talent-signal/participations"}},"identifier":"cg/talent-signal"}