{"id":48785,"name":"Augmented Reality Community Group","is_closed":false,"description":"<p>The W3C Augmented Reality Community Group is an open forum for collaborative discussions about the intersection of Augmented Reality and the Web, or more simply the Augmented Web. This forum welcomes discussions about related standards, the standardisation process, related market developments and the broader social implications of this new generation of the web.</p>\r\n\r\n<p>We believe that the Augmented Web brings a unique perspective that pushes standards, APIs, hardware technologies and the broader web platform to the edge of their performance limits. The Augmented Web embraces the changes brought about by HTML5 and other related standards  including Geolocation, DeviceOrientation, DeviceMotion, WebGL, Web Audio, Media Capture &amp; Streams and WebRTC. The Augmented Web integrates all of these disparate technologies into an integrated new vision of the web.</p>\r\n\r\n<p>This group will not produce specifications. </p>\r\n\r\n<p>Instead it aims to build an integrated community voice that reaches out to all of the other relevant working groups and standards bodies to ensure that the Augmented Web perspective is clearly represented and considered. Our goal is to help ensure that the disparate standards and APIs being planned and implemented by these other groups can be seamlessly integrated into this new vision for the Augmented Web. </p>\r\n\r\n<p>Read more about goals and operating guidelines in the Charter: http://www.w3.org/community/ar/wiki/Charter</p>\r\n","shortname":"ar","discr":"w3cgroup","type":"community group","_links":{"self":{"href":"https://api.w3.org/groups/cg/ar"},"homepage":{"href":"https://www.w3.org/community/ar/"},"users":{"href":"https://api.w3.org/groups/cg/ar/users"},"services":{"href":"https://api.w3.org/groups/cg/ar/services"},"chairs":{"href":"https://api.w3.org/groups/cg/ar/chairs"},"join":{"href":"https://www.w3.org/community/ar/join"},"participations":{"href":"https://api.w3.org/groups/cg/ar/participations"}},"identifier":"cg/ar"}