{"id":127522,"name":"HFVRP Community Group","is_closed":false,"description":"<p>This mission of this group is to help re-establish platform interoperability between descendants of the original \"High Fidelity Virtual Reality Platform\" (HFVRP) open source project.</p>\r\n\r\n<p>The group will initially host discussions and coordinate volunteer research efforts in order to identify relevant areas of common ground across HFVRP projects.</p>\r\n\r\n<p>For example, it was once possible to use the \"interface\" client from one platform to connect to a \"domain server\" hosted on a similar, but different platform. As these projects have continued to evolve, the once-shared protocol version (for example) between them has fallen out of sync, inadvertently breaking the possibility of cross-connections.</p>\r\n\r\n<p>By gathering together common interest across multiple projects, this group hopes to then help collectively estimate efforts and help champion neutral sub-projects that can restore specific compatibilities.</p>\r\n\r\n<p>It is suggested that neutral community sub-projects emerging from this group adopt the permissive Lesser GNU Public License (LGPL) open source license. LGPL currently seems to align best with the mission at hand and for these reasons:</p>\r\n<ul>\r\n<li>interoperability across diverse projects is likely to be an ongoing, multi-platform, community-driven effort -- adopting LGPL for these components can help ensure the collective community effort remains transparent and improvable across the entire project space</li>\r\n<li>as degrees of interoperability are restored LGPL dependencies can be version-managed and upgraded per each projects typical dependency update schedules</li>\r\n<li>LGPL is already an approved dependency license across HFVRP projects (ie: all known platforms critically depend on Qt by way of the LGPL) -- by not introducing a new license for these shared efforts, existing open source project audits can remain intact</li>\r\n</ul>\r\n  \r\n<p>This effort will hopefully span across diverse project politics, technical minds, and social circles which can come together and approach compatibility as a shared effort.</p>\r\n\r\n<p>All platforms forked from the original HFVRP code base are welcome to join forces this way and in particular contributing developers, community members, and any others interested in helping broaden platform interoperability.</p>\r\n\r\n<p>Some of the low-level technology skills likely needed to restore interoperability are:</p>\r\n<ul>\r\n<li>familiarity with HFVRP networking protocols and versioning</li>\r\n<li>\"HFM\" internal model formats and corresponding C++ structures</li>\r\n<li>overall \"Oven\" asset baking tool and filesystem layouts</li>\r\n<li>Baked asset structures (materials.json, ktx, modded FBX format w/draco compression, etc.)</li>\r\n<li>Entities \"models.json.gz\" world persistence format and \"domain server\" archive formats</li>\r\n<li>\"Avatar.fst\" and internal blendshape \"de facto\" standards</li>\r\n<li>\"Interface\" client, \"domain server,\" and \"assignment client\" JSON configuration formats</li>\r\n<li> (as common sub-projects emerge) help setting up multi-project Continuous Integration systems</li>\r\n</ul>\r\n\r\n<p>We think it will be easiest for volunteers in cases where interested projects have remained open source, but all HFVRP projects (including closed source ones) are welcome to join and suggest specific layers or features they would nonetheless be interested in seeing reemerged as a common open source dependency.</p>\r\n\r\n<p>This group will not publish Specifications.</p>\r\n\r\n","shortname":"hfvrp","discr":"w3cgroup","type":"community group","_links":{"self":{"href":"https://api.w3.org/groups/cg/hfvrp"},"homepage":{"href":"https://www.w3.org/community/hfvrp/"},"users":{"href":"https://api.w3.org/groups/cg/hfvrp/users"},"services":{"href":"https://api.w3.org/groups/cg/hfvrp/services"},"chairs":{"href":"https://api.w3.org/groups/cg/hfvrp/chairs"},"join":{"href":"https://www.w3.org/community/hfvrp/join"},"participations":{"href":"https://api.w3.org/groups/cg/hfvrp/participations"}},"identifier":"cg/hfvrp"}