{
 "id": 92610,
 "name": "Semantic Web in Health Care and Life Sciences Community Group",
 "is_closed": true,
 "description": "<p><strong>Group closed 2024-06-17</strong></p>\r\n<p>The mission of the Semantic Web Health Care and Life Sciences Community Group (HCLS CG) is to develop, advocate for, and support the use of Semantic Web technologies across health care, life sciences, clinical research and translational medicine.\r\nThese domains stand to gain tremendous benefit from intra- and inter-domain application of Semantic Web technologies as they depend on the interoperability of information from many disciplines.</p>\r\n\r\n<p>The HCLS CG provides a forum for supporting, developing and applying Semantic Web technologies across healthcare, life sciences, clinical research and the continuum of translational medicine.\r\nWithin these contexts, the HCLS CG focuses on the use of Semantic Web technologies to realize specific use cases which themselves have a specific clinical, research of business values.\r\nAs use cases are developed, HCLS CG can solicit advice on technical matters from other Semantic Web related groups and give feedback on the use of technologies based on the work they do.\r\nThe CG may also develop ongoing and mutually productive liaisons with relevant external organizations in healthcare, life sciences, and clinical research, including organizations that are actively working on relevant standards and/or implementations to which the HCLS’s work might contribute.</p>",
 "shortname": "hclscg",
 "spec-publisher": true,
 "discr": "w3cgroup",
 "_links": {
  "self": {
   "href": "https://api.w3.org/groups/cg/hclscg"
  },
  "homepage": {
   "href": "https://www.w3.org/community/hclscg/"
  },
  "users": {
   "href": "https://api.w3.org/groups/cg/hclscg/users"
  },
  "services": {
   "href": "https://api.w3.org/groups/cg/hclscg/services"
  },
  "chairs": {
   "href": "https://api.w3.org/groups/cg/hclscg/chairs"
  },
  "join": {
   "href": "https://www.w3.org/community/hclscg/join"
  },
  "participations": {
   "href": "https://api.w3.org/groups/cg/hclscg/participations"
  }
 },
 "type": "community group",
 "identifier": "cg/hclscg"
}