{"id":50917,"name":"Network-Friendly App and WebApp Best Practices Community Group","is_closed":false,"description":"Welcome to the W3C Community Group for Network Friendly applications!\r\n\r\nIn this group, we are looking for contributions to help us reach the widest possible consensus in a critical area facing the mobile industry.\r\nSmartphones and smartphone applications have established themselves as a major success story in the industry over the past few years. As the number of smartphones and smartphone applications has increased the industry has learnt much on how to create efficient applications for smartphones.\r\nThe GSMA has created a set of guidelines for application developers that will enable improvements across a number of areas including application connectivity, power consumption, network reliability and security.\r\n\r\nBy following these guidelines\r\n- Developers will be better equipped to create fit-for-purpose apps\r\n- Users will experience more responsive and reliable apps and improved battery life\r\n- Mobile operators will see a reduced strain on their networks\r\n\r\nFor a copy of these guidelines check out \r\n\r\nhttp://www.gsma.com/go/download/file=gsmasmarterappsforsmarterphones0112v.0.14.pdf\r\n\r\nGSMA intends to issue an update of the above document by end of 2012. As such, it has compiled a list of items for inclusion in the update after consulting GSMA’s members; they include network operators and device manufactures.\r\nTo ensure the new update will have the widest possible support by all communities across the industry, we have created a Community Group called ‘network friendly Developer guidelines’ under auspices of W3C.\r\nThe new CG is formed with a view to engage other developers or interested parties and reach a consensus as what needs to be added beyond what has already been proposed by GSMA. The proposed items for inclusion are embedded in this document. Check out\r\nhttp://www.w3.org/community/networkfriendly/wiki/images/b/be/Proposed_items_for_inclusion_in_the_update.doc\r\nto download the current suggestions as approved by GSMA.\r\n\r\nAs the update will be released by end of 2012, all changes should be agreed in time before the actual work of writing and editing the document starts in earnest and no later than 1st September 2012. That means the outcome of activities in the CG would be a list of items for inclusion beyond what has already been proposed by GSMA. The outcome would be considered by GSMA for inclusion when updating the document.\r\n\r\nIn Brief, the goal and milestones to bear in mind are as follows.\r\n\r\nGoal\r\n\r\nTo produce a set of items for inclusion in the updated document beyond what has already been suggested (see the enclosed document)\r\n\r\nKey milestones\r\n\r\n19th April to 10th August 2012 to discuss the base document and the proposed updates and reach consensus in the CG on any additional proposals\r\n11th August to 18th August is the cooling off period to take on board last minute suggestions and final touches\r\n19th August to 31st August, GSMA will consider the final input from CG prior to commencing work on the update in September\r\n\r\nAs a rule of thumb, the entire process would be transparent and inclusive to reach agreement by discussion. In the unlikely event of not reaching consensus on burning issues, the (yet to be named) CG chair would make the final decision only as a last resort.\r\n\r\nYou are invited to actively engage with the process to make the resulting document much better than its debut version. We welcome views and contribution with an open mind.","shortname":"networkfriendly","discr":"w3cgroup","type":"community group","_links":{"self":{"href":"https://api.w3.org/groups/cg/networkfriendly"},"homepage":{"href":"https://www.w3.org/community/networkfriendly/"},"users":{"href":"https://api.w3.org/groups/cg/networkfriendly/users"},"services":{"href":"https://api.w3.org/groups/cg/networkfriendly/services"},"chairs":{"href":"https://api.w3.org/groups/cg/networkfriendly/chairs"},"join":{"href":"https://www.w3.org/community/networkfriendly/join"},"participations":{"href":"https://api.w3.org/groups/cg/networkfriendly/participations"}},"identifier":"cg/networkfriendly"}