{
 "id": 47988,
 "name": "Web Education Community Group",
 "is_closed": false,
 "description": "The Web Education Community Group (CG) aims to evolve the Web and improve the overall skill set of the web industry by improving the quality of available web education resources and courses around the world. To do this, we are engaging in several activities, which are the responsibilities of different projects inside the CG:\r\n\r\n1. Learning material: Creating a comprehensive series of tutorial articles to teach all the W3C technologies, which will constantly be updated so that it remains current and best practice. The main basis of this is currently the Web standards curriculum. \r\n\r\n2. Curriculum: Creating a series of structured courses based on the learning material, which educators from around the world can use to teach web design and development in a consistent, effective way.\r\n\r\n3. Outreach: Contacting educators, companies and trainers and getting them to adopt our learning material and curricula. \r\n\r\n4. Training and certification: Training the trainers to help them teach web design and development more effectively, and formulating a plan to, and researching the feasibility of, partnering with them to provide W3C endorsed qualifications. \r\n\r\n5. Membership and policy: Dealing with issues of membership and policy. \r\n\r\n6. International Education: Different groups responsible for outreach and translations into specific languages to serve groups for whom English is not the primary language. \r\n\r\nFor more information, follow the relevant links in the Pages list.\r\n\r\nPlease note that the Web Education Community Group will not be developing any specifications. \r\n",
 "shortname": "webed",
 "discr": "w3cgroup",
 "type": "community group",
 "_links": {
  "self": {
   "href": "https://api.w3.org/groups/cg/webed"
  },
  "homepage": {
   "href": "https://www.w3.org/community/webed/"
  },
  "users": {
   "href": "https://api.w3.org/groups/cg/webed/users"
  },
  "services": {
   "href": "https://api.w3.org/groups/cg/webed/services"
  },
  "chairs": {
   "href": "https://api.w3.org/groups/cg/webed/chairs"
  },
  "join": {
   "href": "https://www.w3.org/community/webed/join"
  },
  "participations": {
   "href": "https://api.w3.org/groups/cg/webed/participations"
  }
 },
 "identifier": "cg/webed"
}