{
 "id": 75075,
 "name": "Colour blindness accessibility Community Group",
 "is_closed": false,
 "description": "The aim of our project is to build new HTML5 specifications that can be used later by developers who wish to create more accessible websites for colour-blind people. The goal is that the specifications, that we are going to suggest, will one day become a standard of HTML5.\r\n \r\nAccording to WHO, 246 million people worldwide, whilst not being blind, suffer from moderate or severe visual impairment. This includes various forms of colour blindness and other visual deficiencies such as glaucoma and cataract. Just like everyone else, colour-blind people use the Internet for professional and private purposes. However, they often encounter accessibility problems. Our challenge is to improve their situation by providing easy-to-use HTML5 specifications to developers.\r\n\r\nTo understand, define and bring solutions to colour-blind people who interact with web interfaces, we are going to conduct user tests with them based on the eye tracking technology. This will allow us to define a corpus of usability rules, according to the level of deficiency of the colour-blind persons. These rules will help us to develop solutions, validate them with other user tests and later develop HTML5 specifications that can be used in CSS.\r\n\r\nThe challenge is not only helping developers with easy-to-use HTML5 markups, but also make them aware of the situation and together build a better Internet with more accessible websites.\r\n\r\nFeel free to join this group if you:\r\n\r\n* are suffering from colour-blindness\r\n* or have field experience developing accessibility solutions for the colour-blind or other visual impairment\r\n* or have experience working with a previous submission to the W3C.",
 "shortname": "colourblindness",
 "discr": "w3cgroup",
 "type": "community group",
 "_links": {
  "self": {
   "href": "https://api.w3.org/groups/cg/colourblindness"
  },
  "homepage": {
   "href": "https://www.w3.org/community/colourblindness/"
  },
  "users": {
   "href": "https://api.w3.org/groups/cg/colourblindness/users"
  },
  "services": {
   "href": "https://api.w3.org/groups/cg/colourblindness/services"
  },
  "chairs": {
   "href": "https://api.w3.org/groups/cg/colourblindness/chairs"
  },
  "join": {
   "href": "https://www.w3.org/community/colourblindness/join"
  },
  "participations": {
   "href": "https://api.w3.org/groups/cg/colourblindness/participations"
  }
 },
 "identifier": "cg/colourblindness"
}