{"id":66476,"name":"Property Graphs Model and API Community Group","is_closed":false,"description":"This group will explore the Property Graph data model and API and decide whether this area is ripe for standardization.   Property Graphs are used to analyze social networks and in other Big Data applications using NoSQL databases.\r\n\r\nThe group may want to investigate several extensions to the data model.  For example, should nodes be typed; what datatypes are allowed for property values; can properties have multiple values and should we add collection types such as sets and maps to the data model?  At the same time, we need to bear in mind that there are several Property Graph vendors and implementations and we may not want to deviate significantly from current practice.\r\n\r\nExisting Property Graph APIs are either navigational e.g. Tinkerpop or declarative e.g. Neo4j.  For a W3C standard we may want to design a more HTTP and REST-oriented  interface in the style of OData Protocol and OData URL Conventions.  In this style, you construct URls for collections of nodes  and edges.  For example, a GET on http://server/nodes  would return the collection of nodes on the server. A GET on http://server/nodes/in(type = ‘knows’ ) would return the collection of incoming arcs with type = ‘knows’ and a GET on http://server/nodes/out(type = ‘created’ ) would return the collection of outgoing arcs with type = ‘created’.  Once a collection of nodes or arcs is selected with the URI, query operators can be used to add functions to select properties to be returned.  Functions can also be used to return aggregate properties such as count and average.\r\n\r\nThe group will deliver a recommendation to the W3C regarding whether and how the Property Graph work should be taken forward towards standardization.\r\n","shortname":"propertygraphs","discr":"w3cgroup","type":"community group","_links":{"self":{"href":"https://api.w3.org/groups/cg/propertygraphs"},"homepage":{"href":"https://www.w3.org/community/propertygraphs/"},"users":{"href":"https://api.w3.org/groups/cg/propertygraphs/users"},"services":{"href":"https://api.w3.org/groups/cg/propertygraphs/services"},"chairs":{"href":"https://api.w3.org/groups/cg/propertygraphs/chairs"},"join":{"href":"https://www.w3.org/community/propertygraphs/join"},"participations":{"href":"https://api.w3.org/groups/cg/propertygraphs/participations"}},"identifier":"cg/propertygraphs"}