{
 "id": 143377,
 "name": "Declarative Dynamic Extensions to HTML Community Group",
 "is_closed": false,
 "description": "<p>The mission of this group is to write the specification of a set of HTML declarative extensions\r\nthat allow :\r\n</p><ul>\r\n\t<li>to write factorised HTML (with help of the handlebars template engine), perform some advanced dynamic behaviors (without javascript requirements),</li>\r\n\t<li>and resolve some separation of concerns problems by adding a design layer between styles and the html document itself.</li>\r\n</ul>\r\nThis declarative design layer will provide, by external XML resources (initially called XML Design System Sheets) subset of handlebars templates to describe how user agent have to render the shadow dom of classical HTML elements.<br />\r\nMoreover, the dynamic behaviours will use the data representation separations allowed by integrating model instance elements from XForms to HTML itself. To complete it, an extension will propose a new way to retrieve datas as a form control replacement based on the editor attribute, inspired from XForms specification.\r\n\r\n<p>This group will produce reports after discussions, specification(s), and maybe a javascript experimental implementation. One or more of this skills and expertise are desired from participants : HTML, XML, Javascript, and an attention to the importance of the javascript unobstrusive recommendation (declarative HTML should be full functionnal , security reasons, stability...).</p>\r\n<p>This group may publish Specifications.</p>",
 "shortname": "html-dynamic-extensions",
 "discr": "w3cgroup",
 "type": "community group",
 "_links": {
  "self": {
   "href": "https://api.w3.org/groups/cg/html-dynamic-extensions"
  },
  "homepage": {
   "href": "https://www.w3.org/community/html-dynamic-extensions/"
  },
  "users": {
   "href": "https://api.w3.org/groups/cg/html-dynamic-extensions/users"
  },
  "services": {
   "href": "https://api.w3.org/groups/cg/html-dynamic-extensions/services"
  },
  "chairs": {
   "href": "https://api.w3.org/groups/cg/html-dynamic-extensions/chairs"
  },
  "join": {
   "href": "https://www.w3.org/community/html-dynamic-extensions/join"
  },
  "participations": {
   "href": "https://api.w3.org/groups/cg/html-dynamic-extensions/participations"
  }
 },
 "identifier": "cg/html-dynamic-extensions"
}