{
 "id": 125898,
 "name": "Merchant Community Group",
 "is_closed": true,
 "description": "<p>The mission of the Merchant Community Group (“Merchant CG”) is to improve the Web for people and organisations that sell goods or services, or accept donations online. This includes both business-to-business (B2B) merchants, business-to-consumer (B2C) merchants as well as not-for-profit donation acceptors. In this non-technical forum, participants will discuss merchant challenges, how emerging Web technologies could help address them, and what additional Web capabilities may be necessary. Likely topics include:</p>\r\n\r\n<ul class=\"show_items\">\r\n<li>Customer interaction, capture and retention via accessible immersive Web experiences;</li>\r\n<li>Web checkout experiences, including the value merchants should gain with W3C's Web payments standards;</li>\r\n<li>Emerging regulatory requirements (e.g., related to privacy or accessibility) and ensuring good customer experience;</li>\r\n<li>The evolution of Web advertising;</li>\r\n<li>Good practices for reducing online fraud;</li>\r\n<li>Enhancements to transaction integrity and assurance;</li>\r\n<li>Improving mobile Web commerce experiences.</li>\r\n</ul>\r\n\r\n<h3>Scope</h3>\r\n\r\n<p>Participants will choose and prioritize discussion topics.</p>\r\n\r\n<p><strong>Activities in Scope</strong></p>\r\n<ul class=\"show_items\">\r\n<li>Education about Web technology trends and the impact on merchants, including through discussions with other W3C groups. These activities will include non-technical briefings.</li>\r\n<li>Identification of current merchant challenges, best practices for addressing them, and how those practices may change for various reasons (e.g., due to evolving privacy practices).</li>\r\n<li>Communication of merchant use cases and requirements to groups within and outside W3C.</li>\r\n<li>Coordinating reviews of the work of other W3C groups (e.g., the Web Payments Working Group, Web Authentication Working Group or Immersive Web Working Group). It is a goal that this group enable high-bandwidth, two-way communication channels with other W3C groups.</li>\r\n</ul>\r\n<p><strong>Activities out of Scope</strong></p>\r\n<ul class=\"show_items\">\r\n<li>Development of technical specifications.</li>\r\n<li>Discussion of specific products or implementations consistent with W3C's Antitrust and Competition Guidance.</li>\r\n</ul>",
 "shortname": "merchant",
 "closed_date": "2023-04-07",
 "spec-publisher": true,
 "discr": "w3cgroup",
 "_links": {
  "self": {
   "href": "https://api.w3.org/groups/cg/merchant"
  },
  "homepage": {
   "href": "https://www.w3.org/community/merchant/"
  },
  "users": {
   "href": "https://api.w3.org/groups/cg/merchant/users"
  },
  "services": {
   "href": "https://api.w3.org/groups/cg/merchant/services"
  },
  "chairs": {
   "href": "https://api.w3.org/groups/cg/merchant/chairs"
  },
  "join": {
   "href": "https://www.w3.org/community/merchant/join"
  },
  "participations": {
   "href": "https://api.w3.org/groups/cg/merchant/participations"
  }
 },
 "type": "community group",
 "identifier": "cg/merchant"
}