{
 "id": 122465,
 "name": "TNS Blockchain Community Group",
 "is_closed": false,
 "description": "A web based blockchain project to explore the use of Digital Names within existing web applications and PaaS and IaaS platforms. \r\nThe English or human language naming solution presented by Digital Names solves a big problem related to the scale-up of blockchain networks and cryptocurrency systems.\r\n\r\nOver a hundred million consumers in the globally currently use eWallets. There are over 100 million Crypto trading accounts registered on the worlds crypto exchanges. All currently use Public Crypto Keys for transaction settlement.\r\n\r\nNew companies and individuals entering the emerging blockchain / crypto financial system for the first time frequently find it difficult to understand how to easily send and receive money from eWallets. To regular people or mainstream users the precise steps involved with sending and receiving digital money is currently limiting usage of the blockchain. It is confusing and intimidating, and creates insecurity of inputting keys wrong and losing the value of a transaction.\r\n\r\nDigital Names simplifies the remembering, typing and everyday usage of digital wallets for crypto and kind of crypto payments or receipts into or out of a Digital Wallet.",
 "shortname": "tnsblockchain",
 "discr": "w3cgroup",
 "type": "community group",
 "_links": {
  "self": {
   "href": "https://api.w3.org/groups/cg/tnsblockchain"
  },
  "homepage": {
   "href": "https://www.w3.org/community/tnsblockchain/"
  },
  "users": {
   "href": "https://api.w3.org/groups/cg/tnsblockchain/users"
  },
  "services": {
   "href": "https://api.w3.org/groups/cg/tnsblockchain/services"
  },
  "chairs": {
   "href": "https://api.w3.org/groups/cg/tnsblockchain/chairs"
  },
  "join": {
   "href": "https://www.w3.org/community/tnsblockchain/join"
  },
  "participations": {
   "href": "https://api.w3.org/groups/cg/tnsblockchain/participations"
  }
 },
 "identifier": "cg/tnsblockchain"
}