{
 "id": 71107,
 "name": "TV Control API Community Group",
 "is_closed": false,
 "description": "The convergence of Internet-based IPTV, Video-on-Demand (VoD), Personal Video, IP multicasting video, cellular multicasting video etc. with traditional broadcasting video, satellite video and cable video is emerging on market. The technology gap between web apps and native apps is rapidly narrowing. Thus a web-based application controlling various TV channels with detailed information regarding TV programs is becoming a more and more main stream TV control application for the integrated video service. Furthermore, in many regions TV broadcasters are developing web applications that can overlay their channel in a hybrid broadcast/broadband environment.\r\n\r\nScope of Work\r\n\r\nThe W3C TV Control API Community Group is to define an API layer that is agnostic of any underlying video sourcing technologies to enable a web-based application to:\r\n-\tprovide EPG information, including the list of TV programs and related information such as channel number, producers, directors, actors, synopsis, rating etc., \r\n-\tcontrol and switch the TV sourcing based on channel identifier from EPG data\r\n-\tinteract with TV platform for presenting the TV program appropriately\r\n-\tinteract with TV platform for presenting other supplemental content appropriately\r\nThe underlying video sourcing method and technologies, the presentation technology and/or presentation application of TV program and supplemental content are all out of scope.\r\n\r\nOperating Guidelines\r\n\r\nThis group operates under the rules of the Community and Business Group Process. All matters relating to intellectual property are governed by the Community Contributor License Agreement (CLA). All participants within this group agree that their discussions will follow the General Communications Policies. \r\n",
 "shortname": "tvapi",
 "discr": "w3cgroup",
 "type": "community group",
 "_links": {
  "self": {
   "href": "https://api.w3.org/groups/cg/tvapi"
  },
  "homepage": {
   "href": "https://www.w3.org/community/tvapi/"
  },
  "users": {
   "href": "https://api.w3.org/groups/cg/tvapi/users"
  },
  "services": {
   "href": "https://api.w3.org/groups/cg/tvapi/services"
  },
  "chairs": {
   "href": "https://api.w3.org/groups/cg/tvapi/chairs"
  },
  "join": {
   "href": "https://www.w3.org/community/tvapi/join"
  },
  "participations": {
   "href": "https://api.w3.org/groups/cg/tvapi/participations"
  }
 },
 "identifier": "cg/tvapi"
}