{"id":125019,"name":"Digital ssset standard Community Group","is_closed":false,"description":"<p>The primary mission of the community group is to bring together (top companies, universities, and teams involved in digital finance technology in various industries) and frontier technology in digital finance to push forward the development to digital asset standardization.</p><p>\r\n\r\n</p><p>What is a digital asset? A digital asset is data with unique identity attributes that are binary coded, owned, or controlled by a company or individual. The data has various manifestations, including text content, images, multimedia, Computer programs, etc. Generally speaking, digital assets include websites and their content, domain names, application software, codes, electronic documents, image content, media content, electronic money, emails, game accounts, other accounts &amp; their content, social network accounts &amp; their relationships and cloud service accounts &amp; their data, etc.</p><p>\r\n\r\n</p><p>The digital asset on the blockchain owns all the general attributes of digital assets above, it also has other characteristics: the computer programs registered on blockchain ledger or distributed ledger, as well as the virtual assets existed in the form of bit structure, can be programmed. The exchange of assets is essentially the exchange of code. The digital assets on the blockchain can achieve complete disintermediation of autonomous and autonomous point-to-point transactions without the need for third-party manual intervention. Once the asset is issued on the blockchain, the subsequent circulation link can be independent of the issuer’s system. As the asset circulation is changed from single-center control to socialized communication, any channel with resources can become a catalyst for asset circulation, which greatly improve the efficiency of digital asset circulation, and truly achieve the effect of \"multi-party issuance and free circulation.\"</p>\r\n\r\n<p>To welcome the era of asset digitization, the group is formed to technically communicate and cooperate with other members, and to develop a broader market together. The problems that we are trying to solve in this group are:</p>\r\n\r\n<ol>\r\n<li>Digital asset operation, trading, development, and supervision standardization;</li>\r\n<li>Formation of industry alliances and specification of industry standards;</li>\r\n<li>Universal education of digital assets</li>\r\n</ol>\r\n\r\n<p>The group aims to support pioneer companies that explore digital assets, encourage communication and cooperation. We are expecting deliverables such as published reports and a service platform on this basis.</p>","shortname":"dascg-dfi168","discr":"w3cgroup","type":"community group","_links":{"self":{"href":"https://api.w3.org/groups/cg/dascg-dfi168"},"homepage":{"href":"https://www.w3.org/community/dascg-dfi168/"},"users":{"href":"https://api.w3.org/groups/cg/dascg-dfi168/users"},"services":{"href":"https://api.w3.org/groups/cg/dascg-dfi168/services"},"chairs":{"href":"https://api.w3.org/groups/cg/dascg-dfi168/chairs"},"join":{"href":"https://www.w3.org/community/dascg-dfi168/join"},"participations":{"href":"https://api.w3.org/groups/cg/dascg-dfi168/participations"}},"identifier":"cg/dascg-dfi168"}