{
 "id": 83156,
 "name": "Machine Learning Schema Community Group",
 "is_closed": false,
 "description": "This group represents a collaborative, community effort with a mission to develop, maintain, and promote standard schemas for data mining and machine learning algorithms, datasets, and experiments.  Our target is a community agreed schema as a basis for ontology development projects, markup languages and data exchange standards; and an extension model for the schema in the area of data mining and machine learning.\r\n\r\nThe goals of this group are:\r\n\r\nTo define a simple shared schema of data mining/ machine learning (DM/ML) algorithms, datasets, and experiments that may be used in many different formats: XML, RDF, OWL, spreadsheet tables.\r\n\r\nCollect use cases from the academic community and industry\r\n\r\nUse this schema as a basis to align existing DM/ML ontologies and develop more specific ontologies with specific purposes/applications\r\n\r\nPrevent a proliferation of incompatible DM/ML ontologies\r\n\r\nTurn machine learning algorithms and results into linked open data\r\n\r\nPromote the use of this schema, including involving stakeholders like ML tool developers\r\nApply for funding (e.g. EU COST, UK Research Councils, Horizon2020 Coordination and Support Actions) to organize workshops, and for dissemination\r\n",
 "shortname": "ml-schema",
 "spec-publisher": true,
 "discr": "w3cgroup",
 "_links": {
  "self": {
   "href": "https://api.w3.org/groups/cg/ml-schema"
  },
  "homepage": {
   "href": "https://www.w3.org/community/ml-schema/"
  },
  "users": {
   "href": "https://api.w3.org/groups/cg/ml-schema/users"
  },
  "services": {
   "href": "https://api.w3.org/groups/cg/ml-schema/services"
  },
  "chairs": {
   "href": "https://api.w3.org/groups/cg/ml-schema/chairs"
  },
  "join": {
   "href": "https://www.w3.org/community/ml-schema/join"
  },
  "participations": {
   "href": "https://api.w3.org/groups/cg/ml-schema/participations"
  }
 },
 "type": "community group",
 "identifier": "cg/ml-schema"
}